[
  {
    "name": "Ad Notify Manager",
    "work_period": "2022",
    "site": "https://github.com/CoderGosha/AdNotifyManager",
    "description": {
      "description": "Новая генерация системы уведомления о новых объявления. Система состоит из трех частей: веб интерфейс, модули парсинга, модули уведомления\n\tВеб  интерфейс позволяет конфигурировать настройки парсеров, подписчиков и удобно распределять запросы между модулями парсинга (инстансами)\n\tМодули парсинга запускаются на сервере или удаленном устройстве, выполняют получение данных и отправляют на сервер. Получение данных осуществляется несколькими способами: прямым запросом, прокси или QueryCommunicator.  Обработка данных (парсинг) использует Selenium и Firefox. \n\tПодсистема уведомления рассылает полученные объявления в нужные каналы или подписчикам (например в телеграм) \n\tТакое разделение позволяет менять отдельные модули (например смена алгоритма парсинга), и расширять систему в случае новых источников данных. ",
      "technology": ["python", "django-rest", "selenium" ]
    }
  },
  {
    "name": "OPC Server UA (open source)",
    "work_period": "2018-2019",
    "site": "https://github.com/OPCFoundation/UA-.NETStandard",
    "description": {
      "description": "Компания ПСС занималась разработкой систем для хуйпойми чео то там. Одной из частей системы является OPC Server. \n\tЯдро сервера распространяется в nuget пакете собраного разработчиками open-source проекта.  Наша команада занималась разработкой дополнительных модулей. Web api для удобного доступа, сохранение и загрузка узлов в долговременоое хранилище. Синхронизация изменений,\n\tОптимизация производительности  \n\tА также запуск на разных ос и с разными источниками данных. \n\tМногие базовые методы были расширены и оптимизировать. При этом сохранаялась  полная  совместимость с оригинальной веткой и регулярно обновлялось ядро.  В результате сервер отлично справлялся с множеством запросов и имел быстрый отклик, а также сохранил первоначальные протоколы доступа. \n\tНаш opc server использовался во многих продуктовых решениях.",
      "technology": ["С#", "ASP Core (web api)", "RabbitMQ"]
    }
  },
  {
    "name": "Backend системы доставки посылок",
    "work_period": "2021-2022",
    "site": "",
    "description": {
      "description": " ",
      "technology": [""]
    }
  }
]